Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Bulk edit flags, labels, or states of strings.
sv: Massredigering av flaggor, etiketter eller strängstatus.

source: Flag updated translations from repository as "Needs rewriting"
sv: Markera uppdaterade översättningar från arkivet som "Behöver skrivas om"

source: Whenever a string translation is changed from the VCS, it is flagged as needing rewriting in Weblate. Especially useful if translation files are often updated manually or by an external service.
sv: När en strängöversättning ändras från VCS markeras den som behöver skrivas om i Weblate. Detta är särskilt användbart om översättningsfiler ofta uppdateras manuellt eller av en extern tjänst.

source: Path of generated MO file
sv: Sökväg till genererad MO-fil

source: If not specified, the location of the PO file will be used.
sv: Om inte angiven så kommer platsen för PO-filen att användas.

source: Include strings needing editing
sv: Inkludera strängar som behöver redigeras

source: Strings needing editing (fuzzy) are typically not ready for use as translations.
sv: Strängar som behöver redigeras (luddiga) är vanligtvis inte redo att användas som översättningar.

source: Name of generated file
sv: Namn på genererad fil

source: Content of generated file
sv: Innehåll för genererad fil

source: Commit squashing
sv: Squasha arkivering

source: All commits into one
sv: Alla arkiveringar till en enda

source: Per language
sv: Per språk

source: Per file
sv: Per fil

source: Per author
sv: Efter författare

source: Append trailers to squashed commit message
sv: Lägg till git-trailers till squashade commit meddelande

source: Trailer lines are lines that look similar to RFC 822 e-mail headers, at the end of the otherwise free-form part of a commit message, such as 'Co-authored-by: â¦'.
sv: Trailer-rader Ã¤r rader som liknar RFC 822 e-posthuvuden i slutet pÃ¥ den i Ã¶vrigt fria delen av ett arkiveringsmeddelande, t.ex. 'Co-authored-by: ...'.

source: Commit message
sv: Arkiveringsmeddelande

source: This commit message will be used instead of the combined commit messages from the squashed commits.
sv: Detta arkiveringsmeddelande kommer att användas istället för det kombinerade arkiveringsmeddelandet från de squashade committerna.

source: Days to keep
sv: Dagar som sparas

source: Voting threshold
sv: Tröskelvärde för röstning

source: Threshold for removal. This field has no effect with voting turned off.
sv: TrÃ¶skelvÃ¤rde fÃ¶r avlÃ¤gsnande. Det hÃ¤r fÃ¤ltet har ingen effekt nÃ¤r rÃ¶stningen Ã¤r avstÃ¤ngd.

source: Regular expression to match translation files against
sv: Reguljärt uttryck för att matcha översättningsfiler mot

source: File format
sv: Filformat

source: Customize the component name
sv: Anpassa komponentnamnet

source: Define the monolingual base filename
sv: Definiera den enspråkiga basspråkfilen

source: Leave empty for bilingual translation files.
sv: LÃ¤mna tom fÃ¶r tvÃ¥sprÃ¥kiga Ã¶versÃ¤ttningsfiler.

source: Define the base file for new translations
sv: Definiera basfil för nya översättningar

source: Filename of file used for creating new translations. For gettext choose .pot file.
sv: Filnamn på fil som används för att skapa nya översättningar. Välj .pot-fil för gettext.

source: Intermediate language file
sv: Mellanliggande språkfil

source: Filename of intermediate translation file. In most cases this is a translation file provided by developers and is used when creating actual source strings.
sv: Filnamn för mellanliggande översättningsfil. I de flesta fall är detta en översättningsfil som tillhandahålls av utvecklare och som används vid skapandet av faktiska källsträngar.

source: Language filter
sv: Språkfilter

source: Regular expression to filter translation files against when scanning for file mask.
sv: Reguljärt uttryck för att filtrera översättningsfiler vid sökning efter filmask.

source: Clone add-ons from the main component to the newly created ones
sv: Klona tillägg från huvudkomponenten till de nyligen skapade

source: Remove components for inexistent files
sv: Ta bort komponenter för icke-befintliga filer

source: I confirm the above matches look correct
sv: Jag bekräftar att ovanstående matchningar ser ut att vara korrekta

source: You can not use a monolingual translation without a base file.
sv: Du kan inte använda enspråkig översättning utan en basfil.

source: You can not use a base file for bilingual translation.
sv: Du kan inte använda en basfil för tvåspråkig översättning.

source: Please review and confirm the matched components.
sv: Granska och bekräfta de matchade komponenterna.

source: Please include component markup in the template.
sv: Inkludera komponent-markup i mallen.

source: Translation threshold
sv: Översättningströskel

source: The percentage of translated strings that must be present for translation to be included.
sv: Den procentandel av översatta strängar som måste finnas för att översättningen ska inkluderas.

source: CSS selector
sv: CSS-väljare

source: CSS selector to detect localizable elements.
sv: CSS-väljare för att upptäcka lokaliserbara element.

source: Language cookie name
sv: Namn på språkcookie

source: Name of cookie which stores language preference.
sv: Namn på cookie som lagrar språkinställningar.

source: Extract strings from HTML files
sv: Extrahera strängar från HTML-filer

source: List of filenames in current repository or remote URLs to parse for translatable strings.
sv: Lista över filnamn i aktuella databas- eller fjärradresser som ska tolkas för översättningsbara strängar.

source: Could not parse CSS selector: %s
sv: Kunde inte tolka CSS-selector: %s

source: Source strings
sv: Källsträngar

source: Target translation
sv: Målöversättning

source: All strings in this translation will be overwritten
sv: Alla strängar i denna översättning kommer att skrivas över

source: Prepended static text
sv: Statisk text i början

source: Prepended variable text
sv: Variabel text i början

source: Appended static text
sv: Statisk text i slutet

source: Appended variable text
sv: Variabel text i slutet

source: Variable text multiplier
sv: Variabel textmultiplikator

source: How many times to repeat the variable text depending on the length of the source string.
sv: Hur många gånger variabeltexten ska upprepas beroende på längden på källsträngen.

source: Include read-only strings
sv: Inkludera skrivskyddade strängar

source: The source and target have to be different languages.
sv: Källan och målet måste vara olika språk.

source: Enable case-sensitive key sorting
sv: Aktivera sortering av tangenter med skiftlägeskänslighet

source: Change events
sv: ÃndringshÃ¤ndelser

source: Webhook secret
sv: Hemlighet för webhook

source: The Standard Webhooks secret is a base64 encoded string.
sv: Standard Webhooks-hemligheten är en base64-kodad sträng.

source: AMQP broker host
sv: AMQP-brokervÃ¤rd

source: The AMQP broker to connect to.
sv: AMQP-brokern som ska anslutas till.

source: Use SSL for AMQP connection
sv: AnvÃ¤nd SSL fÃ¶r AMQP-anslutning

source: CA certificates
sv: CA-certifikat

source: Bundle of PEM encoded CA certificates used to validate the certificate presented by the server.
sv: Paket med PEM-kodade CA-certifikat som anvÃ¤nds fÃ¶r att validera det certifikat som presenteras av servern.

source: Client SSL key
sv: Klient-SSL-nyckel

source: PEM encoded client private SSL key.
sv: PEM-kodad privat SSL-nyckel fÃ¶r klient.

source: Client SSL certificates
sv: SSL-certifikat fÃ¶r klienten

source: PEM encoded client SSL certificate.
sv: PEM-kodat SSL-certifikat fÃ¶r klient.

source: The SSL certificates have to be provided for SSL connection.
sv: SSL-certifikaten måste tillhandahållas för SSL-anslutning.

source: The SSL certificates are not used without a SSL connection.
sv: SSL-certifikaten används inte utan en SSL-anslutning.

source: Statistics generator
sv: Statistikgenerator

source: Generates a file containing detailed info about the translation status.
sv: Genererar en fil med detaljerad information om översättningsstatusen.

source: Pseudolocale generation
sv: Pseudolocale-generering

source: Generates a translation by adding prefix and suffix to source strings automatically.
sv: Skapar en översättning genom att automatiskt lägga till prefix och suffix till källsträngarna.

source: Prefill translation with source
sv: Förfyll översättning med källa

source: Fills in translation strings with source string.
sv: Fyller i översättningssträngar med källsträng.

source: Fill read-only strings with source
sv: Fyll skrivskyddade strängar med källsträngen

source: Fills in translation of read-only strings with source string.
sv: Fyller i översättningen av skrivskyddade strängar med källsträngen.

source: Generate MO files
sv: Generera MO-filer

source: Automatically generates a MO file for every changed PO file.
sv: Genererar automatiskt en MO-fil för varje ändrad PO-fil.

source: Update LINGUAS file
sv: Uppdatera LINGUAS-fil

source: Updates the LINGUAS file when a new translation is added.
sv: Uppdaterar LINGUAS-filen nÃ¤r en ny Ã¶versÃ¤ttning adderas.

source: Update ALL_LINGUAS variable in the "configure" file
sv: Uppdatera ALL_LINGUAS-variabeln i "configure"-filen

source: Updates the ALL_LINGUAS variable in "configure", "configure.in" or "configure.ac" files, when a new translation is added.
sv: Uppdaterar ALL_LINGUAS-variabeln i filerna "configure", "configure.in" och "configure.ac", nÃ¤r en ny Ã¶versÃ¤ttning adderas.

source: Update PO files to match POT (msgmerge)
sv: Uppdatera PO-filerna till att matcha POT (msgmerge)

source: Updates all PO files (as configured by "File mask") to match the POT file (as configured by "Template for new translations") using msgmerge.
sv: Uppdaterar alla PO-filer (som konfigurerats av "filmask") för att matcha POT-filen (som konfigurerad av "mall för nya översättningar") med hjälp av msgmerge.

source: Contributors in comment
sv: Bidragsgivare i kommentar

source: Updates the comment part of the PO file header to include contributor names and years of contributions.
sv: Uppdaterar kommentarsdelen i PO-filens huvud sÃ¥ att deltagarnamn och Ã¥r av bidrag inkluderas.

source: Squash Git commits
sv: Squasha Git arkiveringar

source: Squash Git commits prior to pushing changes.
sv: Squasha Git-arkiveringar innan de pushas.

source: Format the Java properties file
sv: Formatera Java-properties-filen

source: Formats and sorts the Java properties file.
sv: Formaterar och sorterar Java-properties-filen.

source: Stale comment removal
sv: Borttagning av inaktuella kommentarer

source: Set a timeframe for removal of comments.
sv: Ange en tidsram för borttagning av kommentarer.

source: Stale suggestion removal
sv: Borttagning av inaktuella förslag

source: Set a timeframe for removal of suggestions.
sv: Ange en tidsram för borttagning av förslag.

source: Update RESX files
sv: Uppdatera RESX-filer

source: Update all translation files to match the monolingual upstream base file. Unused strings are removed, and new ones added as copies of the source string.
sv: Uppdatera alla översättningsfiler så att de matchar den enspråkiga uppströmsbasfilen. Oanvända strängar tas bort och nya läggs till som kopior av källsträngen.

source: Invalid add-on name: â%sâ
sv: Ogiltigt tillÃ¤ggsnamn: â%sâ

source: Add-on cannot be installed: â%sâ
sv: TillÃ¤gget kan inte installeras: â%sâ

source: Add-on installed, please review integration instructions.
sv: Tillägget är installerat, läs instruktionerna för integrering.

source: Sends notifications to external services based on selected events, following the Standard Webhooks specification.
sv: Skickar aviseringar till externa tjänster baserat på valda händelser, enligt standardspecifikationen för webhooks.

source: Sends notification to a Slack channel based on selected events.
sv: Skickar meddelanden till en Slack-kanal baserat på valda händelser.

source: Session-based authentication used when user is signed in.
sv: Sessionsbaserad autentisering som används när användaren är inloggad.

source: Token-based authentication with required prefix `%s`.
sv: Tokenbaserad autentisering med obligatoriskt prefix `%s`.

source: Each user has a personal access token which they can get from their respective user profile. These tokens have the `wlu_` prefix.
sv: Varje användare har en personlig åtkomsttoken som de kan hämta från sin respektive användarprofil. Dessa tokens har prefixet `wlu_`.

source: It is possible to create project tokens whose access to the API is limited to operations to their associated project. These tokens have the `wlp_` prefix.
sv: Det är möjligt att skapa projekttoken vars åtkomst till API:et är begränsad till operationer för deras associerade projekt. Dessa token har prefixet `wlp_`.

source: Allowed number of requests to perform
sv: Tillåtet antal förfrågningar att utföra

source: Remaining number of requests to perform
sv: Återstående antal förfrågningar att utföra

source: Number of seconds until the rate-limit window resets
sv: Antal sekunder tills frekvensbegränsningsfönstret återställs

source: Scope
sv: Omfattning

source: Is your comment specific to this translation, or generic for all of them?
sv: Är din kommentar specifik för denna översättning eller generell för alla översättningar?

source: Comment text
sv: Kommentarstext

source: You can use Markdown and mention users by @username.
sv: Du kan använda Markdown och nämna användare med @användarnamn.

source: Creation timestamp
sv: Tidsstämpel för skapande

source: If youâre an admin, you can set the explicit timestamp at which the comment was created.
sv: Om du Ã¤r administratÃ¶r kan du ange den exakta tidpunkten dÃ¥ kommentaren skapades.

source: Commenterâs email
sv: Kommenterarens e-post

source: If youâre an admin, you can attribute this comment to another user by their email.
sv: Om du Ã¤r administratÃ¶r kan du tillskriva denna kommentar till en annan anvÃ¤ndare via deras e-postadress.

source: Commit
sv: Arkivera

source: Update with rebase
sv: Uppdatera med ombasering (rebase)

source: Update with merge
sv: Uppdatera med sammanslagning

source: Update with merge without fast-forward
sv: Uppdatera med sammanslagning utan snabbspolning

source: Push
sv: Skicka

source: Reset all changes in the Weblate repository
sv: Återställ alla ändringar i Weblate-arkivet

source: Reset the Weblate repository and reapply translations
sv: Återställ Weblate-arkivet och tillämpa översättningarna på nytt

source: Cleanup all untracked files in the Weblate repository
sv: Städning tar bort alla ospårade filer i Weblate-arkivet

source: Force writing all translations to the Weblate repository
sv: Tvinga alla översättningar att skrivas till Weblate-arkivet

source: Rescan all translation files in the Weblate repository
sv: Skanna om alla översättningsfiler i Weblate-arkivet

source: Could not obtain the lock to perform the operation.
sv: Det gick inte att erhålla låset för att utföra åtgärden.

source: Specified unit id is not a translation source unit.
sv: Angivet enhets-ID är inte en översättningskällenhet.

source: Could not obtain the repository lock for %s to perform the operation.
sv: Kunde inte erhålla låset för arkivet för %s för att utföra åtgärden.

source: Could not obtain the update lock for component %s to perform the operation.
sv: Kunde inte erhålla uppdateringslåset för komponenten %s för att utföra åtgärden.

source: Could not obtain the %(scope)s lock for %(origin)s to perform the operation.
sv: Kunde inte erhålla %(scope)s-låset för %(origin)s för att utföra åtgärden.

source: Component
sv: Komponent

source: Personal info
sv: Personlig info

source: Important dates
sv: Viktiga datum

source: This is not used when a component list is selected.
sv: Detta används inte när en komponentlista är vald.

source: This is not used when a component is selected.
sv: Detta används inte när en komponent är vald.

source: Download changes
sv: Hämta ändringar

source: Post comment
sv: Lägg till kommentar

source: Delete comment
sv: Ta bort kommentar

source: Resolve comment
sv: Lös kommentar

source: Edit component settings
sv: Ändra komponentinställningar

source: Lock component, preventing translations
sv: Lås komponent, förhindrar översättningar

source: Add glossary entry
sv: Lägg till post i ordlista

source: Add glossary terminology
sv: Lägg till ordlisteterm

source: Edit glossary entry
sv: Ändra post i ordlista

source: Delete glossary entry
sv: Ta bort post från ordlista

source: Upload glossary entries
sv: Ladda upp poster till ordlista

source: Use automatic suggestions
sv: Använd automatiska förslag

source: Edit translation memory
sv: Ändra översättningsminne

source: Delete translation memory
sv: Ta bort översättningsminne

source: Edit project settings
sv: Ändra projektinställningar

source: Manage project access
sv: Hantera projektåtkomst

source: Download reports
sv: HÃ¤mta rapporter

source: Add screenshot
sv: Lägg till skärmdump

source: Delete screenshot
sv: Ta bort skärmdump

source: Edit additional string info
sv: Redigera ytterligare stränginformation

source: Add new string
sv: Lägg till ny sträng

source: Remove a string
sv: Ta bort en sträng

source: Dismiss failing check
sv: Avvisa misslyckad kontroll

source: Edit strings
sv: Ändra sträng

source: Bulk edit strings
sv: Massredigera strängar

source: Edit string when suggestions are enforced
sv: Redigera sträng när förslag är tvingande

source: Edit source strings
sv: Ändra källsträng

source: Accept suggestion
sv: Acceptera förslag

source: Delete suggestion
sv: Ta bort förslag

source: Vote on suggestion
sv: Rösta på förslag

source: Add language for translation
sv: Lägg till språk för översättning

source: Perform automatic translation
sv: Utför automatisk översättning

source: Delete existing translation
sv: Ta bort befintlig översättning

source: Download translation file
sv: Ladda ner översättningsfil

source: Add several languages for translation
sv: Lägg till flera språk för översättning

source: Define author of uploaded translation
sv: Definiera författaren för uppladdning av översättning

source: Overwrite existing strings with upload
sv: Skriv över befintliga strängar vid uppladdning

source: Upload translations
sv: Ladda upp översättningar

source: Access the internal repository
sv: Öppna det interna arkivet

source: Commit changes to the internal repository
sv: Arkivera ändringar i det interna arkivet

source: Push change from the internal repository
sv: Pusha ändringar från interna arkivet

source: Reset changes in the internal repository
sv: Återställ ändringar i det interna arkivet

source: View upstream repository location
sv: Visa placering av uppströmsarkivet

source: Update the internal repository
sv: Uppdatera det interna arkivet

source: Post announcements
sv: Publicera meddelanden

source: Use management interface
sv: Använd administrationsgränssnittet

source: Add language definitions
sv: Lägg till språkdefinitioner

source: Manage language definitions
sv: Hantera språkdefinitioner

source: Manage teams
sv: Hantera grupper

source: View team info
sv: Visa teaminformation

source: Manage users
sv: Hantera användare

source: View user info
sv: Visa användarinformation

source: Manage roles
sv: Hantera roller

source: View role info
sv: Visa rollinformation

source: Manage announcements
sv: Hantera meddelanden

source: Manage machinery
sv: Hantera maskinöversättning

source: Manage component lists
sv: Hantera komponentlistor

source: Manage billing
sv: Hantera fakturering

source: Manage site-wide add-ons
sv: Hantera tillägg för hela webbplatsen

source: Edit source
sv: Redigera kÃ¤lla

source: Add suggestion
sv: Lägg till förslag

source: Access repository
sv: Ãppna arkivet

source: Manage glossary
sv: Hantera ordlista

source: Power user
sv: SuperanvÃ¤ndare

source: Translation coordinator
sv: ÃversÃ¤ttningskoordinator

source: Review strings
sv: Granska strängar

source: Manage languages
sv: Hantera sprÃ¥k

source: Manage translation memory
sv: Hantera översättningsminne

source: Manage repository
sv: Hantera arkiv

source: Add new projects
sv: Lägga till nya projekt

source: Guests
sv: GÃ¤ster

source: Viewers
sv: Ã skÃ¥dare

source: Reviewers
sv: Granskare

source: Managers
sv: AdministratÃ¶rer

source: Project creators
sv: Projektskapare

source: Sources
sv: Källor

source: Memory
sv: Minne

source: Bulk editing
sv: Massredigering

source: Automatic translation
sv: Automatisk översättning

source: User invitation e-mail was sent.
sv: Användarinbjudan har skickats via mejl.

source: Cannot change this on a built-in team.
sv: Kan inte ändra detta för en inbyggd grupp.

source: %s (site-wide permission)
sv: %s (behörighet gällande hela webbplatsen)

source: Choose permissions granted to this role.
sv: Välj behörigheter som ska tilldelas denna roll.

source: Roles
sv: Roller

source: Choose roles granted to this team.
sv: Välj roller som tilldelas detta team.

source: Project selection
sv: Val av projekt

source: As defined
sv: Som definierat

source: All projects
sv: Alla projekt

source: All public projects
sv: Alla publika projekt

source: All protected projects
sv: Alla skyddade projekt

source: From component list
sv: Från komponentlista

source: Projects
sv: Projekt

source: Components
sv: Komponenter

source: Empty selection grants access to all components in project scope.
sv: Tomt urval ger tillgång till alla komponenter i projektets omfattning.

source: Component lists
sv: Komponentlistor

source: Language selection
sv: Språkval

source: All languages
sv: Alla språk

source: Internal Weblate team
sv: Internt Weblate-team

source: Team administrators
sv: Gruppadministratörer

source: The administrator can add or remove users from a team.
sv: Administratören kan lägga till eller ta bort användare från en grupp.

source: Enforced two-factor authentication
sv: Tvingande tvåfaktorsautentisering

source: Requires users to have two-factor authentication configured.
sv: Kräver att användarna har tvåfaktorsautentisering konfigurerat.

source: Username may only contain letters, numbers or the following characters: @ . + - _
sv: Användarnamnet får endast innehålla bokstäver, siffror och följande tecken: @ . + - _

source: A user with that username already exists.
sv: Det finns redan en användare med det namnet.

source: Superuser status
sv: Superanvändarstatus

source: User has all possible permissions.
sv: Användaren har alla tillgängliga behörigheter.

source: Mark user as inactive instead of removing.
sv: Markera användaren som inaktiv istället för att ta bort.

source: Expires
sv: UpphÃ¶r

source: The account will be disabled after the expiry.
sv: Kontot kommer att inaktiveras efter utgången.

source: The user is granted all permissions included in membership of these teams.
sv: Användaren beviljas alla behörigheter som ingår i medlemskapet för dessa grupper.

source: Regular expression for e-mail address
sv: Reguljärt uttryck för mail-adress

source: Users with e-mail addresses found to match will be added to this team.
sv: Användare med e-postadresser som matchar kommer att läggas till i detta team.

source: Team to assign
sv: Team att tilldela

source: User to block
sv: Användare som ska blockeras

source: Block expiry
sv: Blockering upphör

source: Block note
sv: Blockeringsanteckning

source: Internal notes regarding blocking the user that are not visible to the user.
sv: Interna anteckningar om blockering av användaren som inte är synliga för användaren.

source: User to add
sv: Användare att lägga till

source: Please type in an existing Weblate account name or e-mail address.
sv: Skriv in ett befintligt Weblate-kontonamn eller en e-postadress.

source: Suggest username for the user. It can be changed later.
sv: Föreslå ett användarnamn för användaren. Det kan ändras senare.
